In [3]:
# import libraries
import pandas as pd
import numpy as np
import os

In [4]:
# create path variable
path = r'/Users/davidcarpenter/Documents/Instacart Basket Analysis'

In [5]:
# import the orders.csv file
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'orders.csv'))

In [6]:
# import the products.csv file
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'))

In [7]:
# create a new dataframe
df_test = pd.DataFrame()

In [8]:
# create a mixed-type column
df_test['mix'] = ['a', 'b', 1, True]

In [15]:
# view the first few rows of the df_test dataframe
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [14]:
# check for mixed data types and output the name of the column that contains mixed data types

for col in df_test.columns.tolist():
  weird = (df_test[[col]].map(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [13]:
# check for missing values in the df_prods dataframe
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [20]:
# save the missing items in the 'product_name' column in the df_nan variable
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [21]:
# view the missing items in df_nan
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [22]:
# find the mean and other data about the df_nan dataframe
df_nan.describe()

         product_id    aisle_id  department_id     prices
count     16.000000   16.000000      16.000000  16.000000
mean    6684.000000   89.937500      10.937500  13.012500
std    12836.665242   33.731229       4.639953   3.881731
min       34.000000   26.000000       1.000000   1.200000
25%      459.250000   70.750000       7.750000  12.175000
50%     2413.000000   98.500000      11.500000  13.650000
75%     3872.750000  120.000000      14.500000  14.425000
max    40440.000000  126.000000      16.000000  20.900000

In [23]:
# find the mean and other data about the df_nan dataframe
df_nan.median()

product_id       2413.0
product_name        NaN
aisle_id           98.5
department_id      11.5
prices            13.65
dtype: object

## How to impute values into a column

In [24]:
# impute the mean: df['column with missings'].fillna(mean value, inplace=True)
# imput the median: df['column with missings'].fillna(median value, inplace=True)

## Returning to the lesson:

In [27]:
df_prods.shape

(49693, 5)

In [52]:
# view products in the 'prodcut_name' column that are _not_ null
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [29]:
df_prods_clean.shape

(49677, 5)

In [30]:
# find duplicates in a dataframe named df_prods_clean
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [31]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [32]:
df_prods_clean.shape

(49677, 5)

In [34]:
# drop duplicates
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [35]:
df_prods_clean_no_dups.shape

(49672, 5)

# Exercise 4.5

## Question 2 - Run the df.describe() function on your df_ords dataframe. Using your new knowledge about how to interpret the output of this function, share in a markdown cell whether anything about the data looks off or should be investigated further.

In [38]:
df_ords.describe()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

### I think that the values summarized in the df_ords.describe() function appear to be within my expecations. The order_dow is between 0 and 6, order_hour_of_day appears normal and the values in the days_since_prior_order appear nominal, too.

## Question 3 - Check for mixed-type data in your df_ords dataframe.

In [45]:
# check for mixed data types and output the name of the column that contains mixed data types

for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].map(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)

### There does not appear to be any duplicates in the df_ords dataframe.

## Question 4 - If you find mixed-type data, fix it. The column in question should contain observations of a single data type.

### There doesn't appear to be columsn with mixed data types.

## Question 5 - Run a check for missing values in your df_ords dataframe. In a markdown cell, report your findings and propose an explanation for any missing values you find.

In [47]:
# check for missing values in the df_ords dataframe
df_ords.isnull().sum()

order_id                       0
user_id                        0
eval_set                       0
order_number                   0
order_dow                      0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

### I believe the high number of missing values in the days_since_prior_order is because these are the first orders for customers, meaning that there should not be any days since the prior order.

## Question 6 - Address the missing values using an appropriate method. In a markdown cell, explain why you used your method of choice.

### I would create a new variable that acts like a flag based on the missing value. The days_since_prior_order column contains integer values and therefore I would not use a string variable such as "n/a" (not applicable) to flag these orders. Rather, I would consider using a value such as "-1" and then communicate to my Data Analysts colleagues the meaning of the -1 value.

## Question 7 - Run a check for duplicate values in your df_ords data. In a markdown cell, report your findings and propose an explanation for any duplicate values you find.

In [48]:
df_ords_dups = df_ords[df_ords.duplicated()]

In [50]:
df_ords_dups.shape

(0, 7)

### I did not find any duplicated values in the dataframe.

## Question 8 - Address the duplicates using an appropriate method. In a markdown cell, explain why you used your method of choice.

### I did not find any duplicates in the df_ords dataframe.

In [55]:
df_ords.to_csv(os.path.join(path, '02 Data','Prepared Data', 'ex4-5-orders.csv'))

In [56]:
df_prods.to_csv(os.path.join(path, '02 Data','Prepared Data', 'ex4-5-products.csv'))